app/controllers/api/books_controller.rb

SELECT "books".* FROM "books"
---
    def index
      respond_with Book.all

INSERT INTO "books" ("title", "author", "description", "reserved", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "k"], ["author", "l"], ["description", "l"], ["reserved", "l"], ["created_at", 2016-12-14 12:44:54 UTC], ["updated_at", 2016-12-14 12:44:54 UTC]]
---
    def create
        book = Book.new(book_params)
        if book.save

SELECT "books".* FROM "books" WHERE (title LIKE '%q%' OR author LIKE '%q%' OR description LIKE '%q%')
---
    def search
      query = params[:query]
      books = Book.where('title LIKE ? OR author LIKE ? OR description LIKE ?',
                           "%#{query}%", "%#{query}%", "%#{query}%")

UPDATE "books" SET "title" = $1, "author" = $2, "description" = $3, "reserved" = $4, "updated_at" = $5 WHERE "books"."id" = $6  [["title", "changed book"], ["author", "KJ"], ["description", "its a book"], ["reserved", "Yes"], ["updated_at", 2016-12-15 14:48:15 UTC], ["id", 7]]
---
    def update
        if @book.update(book_params)